app/Controllers/CtoClearController.php

    public function index()
    {
        $search = $this->request->getGet('search') ?? ''; // Obtém o valor de busca ou define como vazio

        $ctoClearModel = new CtoClearModel();

        if ($search) {
            // Se houver uma busca, filtra os registros por nome do noc, técnico, adicionado, retirado ou motivo
            $incidents = $ctoClearModel->groupStart() // Inicia um grupo de condições
                ->like('pon_slot', $search)
                ->orlike('noc', $search)
                ->orlike('tecnico', $search)
                ->orLike('adicionado', $search)
                ->orLike('retirado', $search)
                ->orLike('motivo', $search)
                ->groupEnd() // Finaliza o grupo de condições
                ->paginate(15);
        } else {
            // Caso contrário, recupera todos os registros
            $incidents = $ctoClearModel->paginate(13);
---
SELECT *
FROM `cto_clear`
 LIMIT 13
SELECT COUNT(*) AS `numrows`
FROM `cto_clear`