app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'samuel'
 LIMIT 1
---
    public function loginMaster()
    {
        // Captura os dados do formulário
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $session = session();
        $model = new UserModel();

        // Busca o usuário no banco de dados
        $user = $model->where('username', $username)->first();