app/Controllers/UserController.php

SELECT *
FROM `users`
 LIMIT 15
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $model = new UserModel(); // Cria uma instância do UserModel

        // Recupera todos os usuários com paginação
        $data['users'] = $model->paginate(15); // Ajuste o número de registros por página conforme necessário