app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'suporte'
AND `password` = 'true'
 LIMIT 1
---
    public function getUser($username, $password) {
        return $this->where(['username' => $username, 'password' => $password])->first(); // Busca usuário com username e password